tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/cask"
brew "mas"
brew "awscli"
brew "awsebcli"
brew "aws-shell"
brew "awsebcli"
brew "bash-completion"
brew "git"
brew "pyenv"


# Apps
cask "spectacle"
cask "powershell"
cask "docker"
cask "kitematic"
cask "gitkraken"
cask "gitup"
cask "iterm2"
cask "lastpass"
cask "mono-mdk"
cask "sql-operations-studio"
cask "visual-studio"
cask "visual-studio-code"
cask "google-chrome"
cask "sourcetree"

# Development
cask "dotnet"
cask "dotnet-sdk"
cask "java"


# K8s
brew "kubectl"

# Go Development
brew 'go', args: ['cross-compile-common']
brew "hg"
brew "bzr"
brew "glide"

# Utilities
brew "telnet"
brew "moreutils"
brew "openssl"
brew "gpg"
brew "jq"
brew "ssh-copy-id"

# Devops tools
tap "jenkins-x/jx"
brew "jx"
cask "vagrant"
# cask "virtualbox"
brew "tfenv"

# node stuff
brew "node"
brew "nvm"

# Other stuff
cask "google-cloud-sdk"
cask "slack"
cask "postman"