tap "homebrew/core"
tap "homebrew/bundle"
tap "jmespath/jmespath"
tap "homebrew/cask-drivers"
tap "aws/tap"
tap "adoptopenjdk/openjdk"

brew "mas"
# brew "awscli"
brew "awsebcli"
brew "aws-shell"
brew "awsebcli"
brew "bash-completion"
brew "git"
brew "aws/tap/copilot-cli"

brew "cmake"
# brew "libgit2"
# brew "binutils"
brew "aws-sam-cli"
brew "tree"
# cask "connectiq"
brew "jenv"
# brew "xz"
brew "zlib"
brew "dnsmasq"
brew "coreutils"
brew "starship"
brew "onefetch"
brew "bfg"
cask "aws-vault"
cask "sqlworkbenchj"

# java
cask "adoptopenjdk"
cask "adoptopenjdk8"
cask "adoptopenjdk8"

# python
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "pyenv-pip-migrate"
brew "pipenv"

# Apps
cask "spectacle"
cask "powershell"
cask "docker"
cask "kitematic"
cask "gitup"
cask "iterm2"
cask "lastpass"
cask "mono-mdk"
cask "visual-studio-code"
# cask "google-chrome"
cask "sourcetree"
brew "fish"
brew "asciinema"
cask "pgadmin4"

cask "dotnet-sdk"

# Go Development
brew 'go', args: ['cross-compile-common']
brew "bzr"

# Utilities
brew "telnet"
brew "moreutils"
brew "openssl"
brew "gpg"
brew "jq"
brew "jp"
brew "ssh-copy-id"
brew "httpie"
cask "logitech-options"
brew "wget"
brew "lastpass-cli"
brew "pwgen"
brew "readline"
brew "denisidoro/tools/navi"
brew "shellcheck"
brew "graphviz"
brew "pgcli"
brew "gitleaks"

# Devops tools
brew "tfenv"
brew "tflint"
cask "http-toolkit"
brew "git-flow"

brew "mitmproxy" # http proxy

# node stuff
brew "node"
brew "nvm"
brew "yarn"

# Other stuff
cask "google-cloud-sdk" 
cask "slack"
cask "postman"

# Fonts
tap "homebrew/cask-fonts"
cask "font-fira-code"

# Required for CloudMapper
brew "autoconf"
brew "automake"
brew "libtool"

brew "figlet"
brew "ruby"
brew "redis"


cask "chef/chef/inspec"
brew "terraformer"
brew "circleci"
brew "pipx"
brew "gh"
cask "rectangle"
brew "yq"
cask "gimp"
brew "flyway"
cask "redisinsight"
brew "rain"
brew "guumaster/tap/hostctl"
brew "direnv"
brew "terraform-docs"
brew "docker-credential-helper-ecr"
brew "checkov"
brew "gitui"
