tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/cask"
tap "jmespath/jmespath"
tap "homebrew/cask-drivers"
tap "wallix/awless"
tap "aws/tap"
tap "caskroom/versions"

brew "mas"
# brew "awscli"
brew "awsebcli"
brew "aws-shell"
brew "awsebcli"
brew "bash-completion"
brew "git"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "awless"
brew "cmake"
brew "libgit2"
# brew "binutils"
brew "aws-sam-cli"
brew "tree"
# cask "connectiq"
brew "jenv"
brew "sqlite3"
brew "xz"
brew "zlib"
brew "dnsmasq"
brew "bash"
brew "coreutils"
brew "starship"
brew "onefetch"

# Apps
cask "spectacle"
cask "powershell"
cask "docker"
cask "kitematic"
cask "gitkraken"
cask "gitup"
cask "iterm2"
cask "lastpass"
cask "mono-mdk"
cask "sql-operations-studio"
cask "visual-studio-code"
cask "google-chrome"
cask "sourcetree"
cask "microsoft-teams"
brew "fish"
brew "asciinema"
cask "eclipse-java"
cask "rider"
cask "atom"

# Development
cask "dotnet-sdk"
cask "java"
cask "java8"
brew "maven"

# K8s
brew "kubectl"

# Go Development
brew 'go', args: ['cross-compile-common']
brew "hg"
brew "bzr"
brew "glide"

# Utilities
brew "telnet"
brew "moreutils"
brew "openssl"
brew "gpg"
brew "jq"
brew "jp"
brew "ssh-copy-id"
brew "httpie"
brew "influxdb"
brew "kapacitor"
brew "brightness"
cask "logitech-options"
brew "wget"
brew "lastpass-cli", args: ['with-pinentry']
brew "pwgen"
brew "readline"
brew "denisidoro/tools/navi"

# Devops tools
brew "tfenv"
cask "http-toolkit"


# node stuff
brew "node"
brew "nvm"

# Other stuff
cask "google-cloud-sdk"
cask "slack"
cask "postman"